IDEA Open Model
ReinfBarOnEdge.ExtendTypeBegin Property
Compatible with IDEA StatiCa Beta 20.0
 type of extension of beginning of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public BarEndExtendType ExtendTypeBegin { get; set; }
Public Property ExtendTypeBegin As BarEndExtendType
	Get
	Set
Property Value
Type: BarEndExtendType
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace